jmeter/商品列表查询压测.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="商品列表查询压测">
      <stringProp name="TestPlan.comments">100 threads x 100 loops; override host/port with -Jtarget_host and -Jtarget_port</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="target_host" elementType="Argument"><stringProp name="Argument.name">target_host</stringProp><stringProp name="Argument.value">${__P(target_host,localhost)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="target_port" elementType="Argument"><stringProp name="Argument.name">target_port</stringProp><stringProp name="Argument.value">${__P(target_port,8080)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="商品查询 100 并发">
        <intProp name="ThreadGroup.num_threads">100</intProp><intProp name="ThreadGroup.ramp_time">10</intProp><stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"><stringProp name="LoopController.loops">100</stringProp><boolProp name="LoopController.continue_forever">false</boolProp></elementProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP 默认值"><stringProp name="HTTPSampler.domain">${target_host}</stringProp><stringProp name="HTTPSampler.port">${target_port}</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.implementation">HttpClient4</stringProp></ConfigTestElement><hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="商品列表"><stringProp name="HTTPSampler.path">/user/product?page=1&amp;pageSize=10&amp;categoryId=${__Random(1,10)}</stringProp><stringProp name="HTTPSampler.method">GET</stringProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp></HTTPSamplerProxy><hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>