jmeter/混合场景压测.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="混合场景压测"><stringProp name="TestPlan.comments">80% product reads and 20% seckill requests; 200 concurrent users for 5 minutes</stringProp><elementProp name="TestPlan.user_defined_variables" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="target_host" elementType="Argument"><stringProp name="Argument.name">target_host</stringProp><stringProp name="Argument.value">${__P(target_host,localhost)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="target_port" elementType="Argument"><stringProp name="Argument.name">target_port</stringProp><stringProp name="Argument.value">${__P(target_port,8080)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="coupon_id" elementType="Argument"><stringProp name="Argument.name">coupon_id</stringProp><stringProp name="Argument.value">${__P(coupon_id,1)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="token" elementType="Argument"><stringProp name="Argument.name">token</stringProp><stringProp name="Argument.value">${__P(token,REPLACE_ME)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp></TestPlan><hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="混合 200 并发"><intProp name="ThreadGroup.num_threads">200</intProp><intProp name="ThreadGroup.ramp_time">10</intProp><boolProp name="ThreadGroup.scheduler">true</boolProp><stringProp name="ThreadGroup.duration">${__P(duration,300)}</stringProp><stringProp name="ThreadGroup.on_sample_error">continue</stringProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController"><stringProp name="LoopController.loops">-1</stringProp><boolProp name="LoopController.continue_forever">true</boolProp></elementProp></ThreadGroup><hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP 默认值"><stringProp name="HTTPSampler.domain">${target_host}</stringProp><stringProp name="HTTPSampler.port">${target_port}</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.implementation">HttpClient4</stringProp></ConfigTestElement><hashTree/><HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="鉴权"><collectionProp name="HeaderManager.headers"><elementProp name="" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${token}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="20% 秒杀"><intProp name="ThroughputController.style">1</intProp><stringProp name="ThroughputController.percentThroughput">20.0</stringProp><boolProp name="ThroughputController.perThread">true</boolProp></ThroughputController><hashTree><HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="秒杀抢购"><stringProp name="HTTPSampler.path">/user/seckill/coupon/${coupon_id}/orders</stringProp><stringProp name="HTTPSampler.method">POST</stringProp></HTTPSamplerProxy><hashTree/></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="80% 商品查询"><intProp name="ThroughputController.style">1</intProp><stringProp name="ThroughputController.percentThroughput">80.0</stringProp><boolProp name="ThroughputController.perThread">true</boolProp></ThroughputController><hashTree><HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="商品列表"><stringProp name="HTTPSampler.path">/user/product?page=1&amp;pageSize=10&amp;categoryId=${__Random(1,10)}</stringProp><stringProp name="HTTPSampler.method">GET</stringProp></HTTPSamplerProxy><hashTree/></hashTree>
      </hashTree></hashTree>
  </hashTree>
</jmeterTestPlan>